if __name__ == '__main__':
    print("\n__________________________________________part 3______________________________\n")
    month = int(input("Введіть номер місяця: "))
    while month<1 or month>12:
        month = int(input("Введіть номер місяця: "))
    if month == 1:
        print("Рік тільки почався. залишилось 11 місяців")
    elif month == 12:
        print("Кінець року")
    elif 12 - month == 1:
        print("До кінця року залишвся 1 місяць")
    elif 12 - month >= 2 and 12 - month <= 4:
        print("До кінця року залишились", 12 - month, "місяці")
    else:
        print("До кінця року залишилось", 12 - month, "місяців")